<?php
# Assoc Library
# 連想配列のライブラリです。辞書的な使い方をする連想配列の登録はこちらへ。
# require_once関数やinclude_once関数で外部ファイルとして取り込んで使用してください。

# 先頭に順序をつけた配列として登録可能な項目数は、数字からアルファベット順に 0_ ~ m_ の範囲です。
# 順序の付け方を変更したり桁数を増やすことで理論上はいくつでも増やせますが、正直なところ上記の方法で足りなくなる項目の多さというのは単に項目を増やしすぎているだけという可能性が高いです。

# なお実力的に可能ならば以下の内容はPostgreSQLのデータテーブルとして取り込むことも可能です。（2022年度バックエンド班の方法）

# リンクの種類
$LINK_ASSOC = [
    "0_Facebook" => "Facebook",
    "1_Xtwitter" => "X(Twitter)",
    "2_Instagram" => "Instagram",
    "3_Tumbler" => "Tumbler",
    "4_Blog" => "Blog",
    "5_Youtube" => "Youtube",
    "6_Pixiv" => "Pixiv",
    "7_Artstation" => "Artstation",
    "8_Portfolio" => "Portfolio",
    "n_None" => "無し",
];

# ジャンルの種類
$GENRE_ASSOC = [
    "0_Graphic" => "グラフィック",
    "1_Book" => "書籍",
    "2_ThreeDim" => "立体",
    "3_Photo" => "写真",
    "4_Movie" => "映像",
    "5_Web" => "ウェブ",
    "6_Interact" => "インタラクション",
    "7_Research" => "調査・研究",
    "8_Installation" => "インスタレーション",
    "9_Game" => "ゲーム",
    "a_Painting" => "絵画",
    "n_None" => "無し",
];

# ゼミの種類
$SEMI_ASSOC = [
    "0_Shiraishi" => "白石ゼミ",
    "1_Sato" => "Ｊ佐藤ゼミ",
    "2_Takayama" => "高山ゼミ",
    "3_Inoue" => "井上ゼミ",
    "4_Oishi" => "大石ゼミ",
    "5_Shimbo" => "新保ゼミ"
];

# 学位の種類
$DEGREE_ASSOC = [
    "0_Bachelor" => "学部生：学士課程",
    "1_Master" => "院生：修士課程（博士課程前期）",
    "2_Docter" => "院生：博士課程（博士課程後期）"
];

# アイコンの種類（基本的に以下の2つから変更するべきではありません。）
$ICON_ASSOC = [
    "album" => "アルバム用画像",
    "free" => "自身で用意した画像"
];

# 展示場所IDと実際の展示場所名の対応
$PLACE_ASSOC = [
"9号館1Fゼロスペース" => "9_1",

"9号館地下展示室（大） 脇通路" => "9_m1",
"9号館地下展示室（大）機材庫" => "9_m1",
"9号館地下展示室（大）" => "9_m1",

"9号館305C" => "9_3",
"9号館305D" => "9_3",
"9号館306C" => "9_3",
"9号館307" => "9_3",
"9号館309" => "9_3",
"9号館3F EVホール" => "9_3",

"9号館402" => "9_4",
"9号館403" => "9_4",
"9号館404" => "9_4",
"9号館405" => "9_4",
"9号館409" => "9_4",
"9号館415A" => "9_4",
"9号館4F EVホール" => "9_4",

"12号館地下展示室" => "12_1",

"10号館111" => "10_1",
"10号館116" => "10_1",
"10号館前芝生" => "10_1",

"2号館トイレ上" => "2_1",

"14号館地下展示室" => "14_1"
];
?>
